-------------------------------------------------
Sensitivity analysis for thermal conductivities
-------------------------------------------------

#+BEGIN_SRC ipython :session 
  %matplotlib inline
  import matplotlib.pyplot as plt
  import numpy as np

  import sys
  import os
  os.chdir("/home/jk125262/PythonDir")
  from mypackage.plot import specs as sc
  from mypackage.run import runmodule as rm
#+END_SRC

#+RESULTS:

** Sensitivity matrix 
   
   Calculate the sensitivty matrix (sense) at different time points
   - sense[it,imon,ilet]
     - it: Time index
     - imon: Monitoring point (0:8 outer, 8:16 inner)
     - ilet: Different runs with different heat conductivity

#+BEGIN_SRC ipython :session   :exports both
  num_mons = sc.num_mons(sc.model_name,sc.dat,sc.lets[0])
  sense = np.zeros([3,num_mons,len(sc.lets)])

  l = np.arange(1.5,3.0,0.0015)

  for i,let in enumerate(sc.lets):
    temp = np.load('output/sensitivity/npy/truetemp_'+sc.model_name+'_'+sc.dat+'_'+let+'_'+str(num_mons).zfill(4)+'.npy')

    sense[:,:,i] = temp[[200,350,500],:]

  np.save('output/sensitivity/npy/sense_'+sc.model_name+'_'+sc.dat+'_'+sc.lets[0]+'_'+str(num_mons).zfill(4)+'.npy',sense)
  sense.shape
#+END_SRC

#+RESULTS:
| 3 | 16 | 1000 |

** Temperature differences 
#+BEGIN_SRC ipython :session   :exports both
  [str(sense[i,0,-1]-sense[i,0,333]) for i in [0,1,2]]
#+END_SRC

#+RESULTS:
| 0.158253 | 0.576074 | 0.714051 |
Delta T between 2-3 W/Km

** Sensitivity matrix 
   
   Calculate the sensitivty matrix (sense) at different time points
   - sense[it,imon,ilet]
     - it: Time index
     - imon: Monitoring point (0:8 outer, 8:16 inner)
     - ilet: Different runs with different heat conductivity

#+BEGIN_SRC ipython :session   :exports both
  num_mons = sc.num_mons(sc.model_name,sc.dat,sc.lets[0])
  sense = np.zeros([3,num_mons,len(sc.lets)])

  l = np.arange(0.5,1.5,0.001)

  for i,let in enumerate(sc.lets):
    temp = np.load('output/sensitivity/npy/truetemp_'+sc.model_name+'_'+sc.dat+'_'+let+'_'+str(num_mons).zfill(4)+'.npy')

    sense[:,:,i] = temp[[200,350,500],:]

  np.save('output/sensitivity/npy/sense_'+sc.model_name+'_'+sc.dat+'_'+sc.lets[0]+'_'+str(num_mons).zfill(4)+'.npy',sense)
  np.save('output/sensitivity/npy/l_'+sc.model_name+'_'+sc.dat+'_'+sc.lets[0]+'_'+str(num_mons).zfill(4)+'.npy',l)
  sense.shape
#+END_SRC

#+RESULTS:
| 3 | 16 | 1000 |

** Temperature differences 
   Delta T between 0.5-1.5 W/Km
   
#+BEGIN_SRC ipython :session   :exports both
  [str(sense[i,0,-1]-sense[i,0,0]) for i in [0,1,2]]
  #sense[0,0,-1]
#+END_SRC

#+RESULTS:
| -0.354307 | -0.405484 | -0.373815 |

** Sensitivity matrix 
   
   Calculate the sensitivty matrix (sense) at different time points
   - sense[it,imon,ilet]
     - it: Time index
     - imon: Monitoring point (0:8 outer, 8:16 inner)
     - ilet: Different runs with different heat conductivity

#+BEGIN_SRC ipython :session   :exports both
  num_mons = sc.num_mons(sc.model_name,sc.dat,sc.lets[0])
  sense = np.zeros([3,num_mons,len(sc.lets)])

  l = np.arange(1.0,3.0,0.002)

  for i,let in enumerate(sc.lets):
    temp = np.load('output/sensitivity/npy/truetemp_'+sc.model_name+'_'+sc.dat+'_'+let+'_'+str(num_mons).zfill(4)+'.npy')

    sense[:,:,i] = temp[[200,350,500],:]

  np.save('output/sensitivity/npy/sense_'+sc.model_name+'_'+sc.dat+'_'+sc.lets[0]+'_'+str(num_mons).zfill(4)+'.npy',sense)
  np.save('output/sensitivity/npy/l_'+sc.model_name+'_'+sc.dat+'_'+sc.lets[0]+'_'+str(num_mons).zfill(4)+'.npy',l)
  sense.shape
#+END_SRC

#+RESULTS:
| 3 | 16 | 1000 |

** Temperature differences 
#+BEGIN_SRC ipython :session   :exports both
  sense = np.load('output/sensitivity/npy/sense_'+sc.model_name+'_'+sc.dat+'_'+sc.lets[0]+'_'+str(num_mons).zfill(4)+'.npy')
  [str(sense[i,0,-1]-sense[i,0,333]) for i in [0,1,2]]
  #sense[0,0,-1]
#+END_SRC

#+RESULTS:
| -0.094198 | -0.097906 | -0.090124 |

Delta T between 2-3 W/Km

** Sensitivity matrix 
   
   Calculate the sensitivty matrix (sense) at different time points
   - sense[it,imon,ilet]
     - it: Time index
     - imon: Monitoring point (0:8 outer, 8:16 inner)
     - ilet: Different runs with different heat conductivity

#+BEGIN_SRC ipython :session   :exports both
  num_mons = sc.num_mons(sc.model_name,sc.dat,sc.lets[0])
  sense = np.zeros([3,num_mons,len(sc.lets)])

  l = np.arange(1.5,3.0,0.0015)

  for i,let in enumerate(sc.lets):
    temp = np.load('output/sensitivity/npy/truetemp_'+sc.model_name+'_'+sc.dat+'_'+let+'_'+str(num_mons).zfill(4)+'.npy')

    sense[:,:,i] = temp[[200,350,500],:]

  np.save('output/sensitivity/npy/sense_'+sc.model_name+'_'+sc.dat+'_'+sc.lets[0]+'_'+str(num_mons).zfill(4)+'.npy',sense)
  sense.shape
#+END_SRC

#+RESULTS:
| 3 | 16 | 1000 |

** Temperature differences 
#+BEGIN_SRC ipython :session   :exports both
  [str(sense[i,0,-1]-sense[i,0,333]) for i in [0,1,2]]
  #sense[0,0,-1]
#+END_SRC

#+RESULTS:
| -0.094198 | -0.097906 | -0.090124 |

Delta T between 2-3 W/Km
